Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S167L */
#define IFX_DMU_HP_PROCON_P5_S167L_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S168L */
#define IFX_DMU_HP_PROCON_P5_S168L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S168L */
#define IFX_DMU_HP_PROCON_P5_S168L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S168L */
#define IFX_DMU_HP_PROCON_P5_S168L_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S169L */
#define IFX_DMU_HP_PROCON_P5_S169L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S169L */
#define IFX_DMU_HP_PROCON_P5_S169L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S169L */
#define IFX_DMU_HP_PROCON_P5_S169L_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S170L */
#define IFX_DMU_HP_PROCON_P5_S170L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S170L */
#define IFX_DMU_HP_PROCON_P5_S170L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S170L */
#define IFX_DMU_HP_PROCON_P5_S170L_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S171L */
#define IFX_DMU_HP_PROCON_P5_S171L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S171L */
#define IFX_DMU_HP_PROCON_P5_S171L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S171L */
#define IFX_DMU_HP_PROCON_P5_S171L_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S172L */
#define IFX_DMU_HP_PROCON_P5_S172L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S172L */
#define IFX_DMU_HP_PROCON_P5_S172L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S172L */
#define IFX_DMU_HP_PROCON_P5_S172L_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S173L */
#define IFX_DMU_HP_PROCON_P5_S173L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S173L */
#define IFX_DMU_HP_PROCON_P5_S173L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S173L */
#define IFX_DMU_HP_PROCON_P5_S173L_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S174L */
#define IFX_DMU_HP_PROCON_P5_S174L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S174L */
#define IFX_DMU_HP_PROCON_P5_S174L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S174L */
#define IFX_DMU_HP_PROCON_P5_S174L_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S175L */
#define IFX_DMU_HP_PROCON_P5_S175L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S175L */
#define IFX_DMU_HP_PROCON_P5_S175L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S175L */
#define IFX_DMU_HP_PROCON_P5_S175L_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S176L */
#define IFX_DMU_HP_PROCON_P5_S176L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S176L */
#define IFX_DMU_HP_PROCON_P5_S176L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S176L */
#define IFX_DMU_HP_PROCON_P5_S176L_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S177L */
#define IFX_DMU_HP_PROCON_P5_S177L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S177L */
#define IFX_DMU_HP_PROCON_P5_S177L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S177L */
#define IFX_DMU_HP_PROCON_P5_S177L_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S178L */
#define IFX_DMU_HP_PROCON_P5_S178L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S178L */
#define IFX_DMU_HP_PROCON_P5_S178L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S178L */
#define IFX_DMU_HP_PROCON_P5_S178L_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S179L */
#define IFX_DMU_HP_PROCON_P5_S179L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S179L */
#define IFX_DMU_HP_PROCON_P5_S179L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S179L */
#define IFX_DMU_HP_PROCON_P5_S179L_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S180L */
#define IFX_DMU_HP_PROCON_P5_S180L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S180L */
#define IFX_DMU_HP_PROCON_P5_S180L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S180L */
#define IFX_DMU_HP_PROCON_P5_S180L_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S181L */
#define IFX_DMU_HP_PROCON_P5_S181L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S181L */
#define IFX_DMU_HP_PROCON_P5_S181L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S181L */
#define IFX_DMU_HP_PROCON_P5_S181L_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S182L */
#define IFX_DMU_HP_PROCON_P5_S182L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S182L */
#define IFX_DMU_HP_PROCON_P5_S182L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S182L */
#define IFX_DMU_HP_PROCON_P5_S182L_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S183L */
#define IFX_DMU_HP_PROCON_P5_S183L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S183L */
#define IFX_DMU_HP_PROCON_P5_S183L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S183L */
#define IFX_DMU_HP_PROCON_P5_S183L_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S184L */
#define IFX_DMU_HP_PROCON_P5_S184L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S184L */
#define IFX_DMU_HP_PROCON_P5_S184L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S184L */
#define IFX_DMU_HP_PROCON_P5_S184L_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S185L */
#define IFX_DMU_HP_PROCON_P5_S185L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S185L */
#define IFX_DMU_HP_PROCON_P5_S185L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S185L */
#define IFX_DMU_HP_PROCON_P5_S185L_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S186L */
#define IFX_DMU_HP_PROCON_P5_S186L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S186L */
#define IFX_DMU_HP_PROCON_P5_S186L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S186L */
#define IFX_DMU_HP_PROCON_P5_S186L_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S187L */
#define IFX_DMU_HP_PROCON_P5_S187L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S187L */
#define IFX_DMU_HP_PROCON_P5_S187L_MSK (0x1u)

