Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S187L */
#define IFX_DMU_HP_PROCON_P5_S187L_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S188L */
#define IFX_DMU_HP_PROCON_P5_S188L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S188L */
#define IFX_DMU_HP_PROCON_P5_S188L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S188L */
#define IFX_DMU_HP_PROCON_P5_S188L_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S189L */
#define IFX_DMU_HP_PROCON_P5_S189L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S189L */
#define IFX_DMU_HP_PROCON_P5_S189L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S189L */
#define IFX_DMU_HP_PROCON_P5_S189L_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S190L */
#define IFX_DMU_HP_PROCON_P5_S190L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S190L */
#define IFX_DMU_HP_PROCON_P5_S190L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S190L */
#define IFX_DMU_HP_PROCON_P5_S190L_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_P5_Bits.S191L */
#define IFX_DMU_HP_PROCON_P5_S191L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P5_Bits.S191L */
#define IFX_DMU_HP_PROCON_P5_S191L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P5_Bits.S191L */
#define IFX_DMU_HP_PROCON_P5_S191L_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S0ROM */
#define IFX_DMU_HP_PROCON_OTP0_S0ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S0ROM */
#define IFX_DMU_HP_PROCON_OTP0_S0ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S0ROM */
#define IFX_DMU_HP_PROCON_OTP0_S0ROM_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S1ROM */
#define IFX_DMU_HP_PROCON_OTP0_S1ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S1ROM */
#define IFX_DMU_HP_PROCON_OTP0_S1ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S1ROM */
#define IFX_DMU_HP_PROCON_OTP0_S1ROM_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S2ROM */
#define IFX_DMU_HP_PROCON_OTP0_S2ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S2ROM */
#define IFX_DMU_HP_PROCON_OTP0_S2ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S2ROM */
#define IFX_DMU_HP_PROCON_OTP0_S2ROM_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S3ROM */
#define IFX_DMU_HP_PROCON_OTP0_S3ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S3ROM */
#define IFX_DMU_HP_PROCON_OTP0_S3ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S3ROM */
#define IFX_DMU_HP_PROCON_OTP0_S3ROM_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S4ROM */
#define IFX_DMU_HP_PROCON_OTP0_S4ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S4ROM */
#define IFX_DMU_HP_PROCON_OTP0_S4ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S4ROM */
#define IFX_DMU_HP_PROCON_OTP0_S4ROM_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S5ROM */
#define IFX_DMU_HP_PROCON_OTP0_S5ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S5ROM */
#define IFX_DMU_HP_PROCON_OTP0_S5ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S5ROM */
#define IFX_DMU_HP_PROCON_OTP0_S5ROM_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S6ROM */
#define IFX_DMU_HP_PROCON_OTP0_S6ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S6ROM */
#define IFX_DMU_HP_PROCON_OTP0_S6ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S6ROM */
#define IFX_DMU_HP_PROCON_OTP0_S6ROM_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S7ROM */
#define IFX_DMU_HP_PROCON_OTP0_S7ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S7ROM */
#define IFX_DMU_HP_PROCON_OTP0_S7ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S7ROM */
#define IFX_DMU_HP_PROCON_OTP0_S7ROM_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S8ROM */
#define IFX_DMU_HP_PROCON_OTP0_S8ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S8ROM */
#define IFX_DMU_HP_PROCON_OTP0_S8ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S8ROM */
#define IFX_DMU_HP_PROCON_OTP0_S8ROM_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S9ROM */
#define IFX_DMU_HP_PROCON_OTP0_S9ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S9ROM */
#define IFX_DMU_HP_PROCON_OTP0_S9ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S9ROM */
#define IFX_DMU_HP_PROCON_OTP0_S9ROM_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S10ROM */
#define IFX_DMU_HP_PROCON_OTP0_S10ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S10ROM */
#define IFX_DMU_HP_PROCON_OTP0_S10ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S10ROM */
#define IFX_DMU_HP_PROCON_OTP0_S10ROM_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S11ROM */
#define IFX_DMU_HP_PROCON_OTP0_S11ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S11ROM */
#define IFX_DMU_HP_PROCON_OTP0_S11ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S11ROM */
#define IFX_DMU_HP_PROCON_OTP0_S11ROM_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S12ROM */
#define IFX_DMU_HP_PROCON_OTP0_S12ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S12ROM */
#define IFX_DMU_HP_PROCON_OTP0_S12ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S12ROM */
#define IFX_DMU_HP_PROCON_OTP0_S12ROM_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S13ROM */
#define IFX_DMU_HP_PROCON_OTP0_S13ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S13ROM */
#define IFX_DMU_HP_PROCON_OTP0_S13ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S13ROM */
#define IFX_DMU_HP_PROCON_OTP0_S13ROM_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S14ROM */
#define IFX_DMU_HP_PROCON_OTP0_S14ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S14ROM */
#define IFX_DMU_HP_PROCON_OTP0_S14ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S14ROM */
#define IFX_DMU_HP_PROCON_OTP0_S14ROM_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S15ROM */
#define IFX_DMU_HP_PROCON_OTP0_S15ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S15ROM */
#define IFX_DMU_HP_PROCON_OTP0_S15ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S15ROM */
#define IFX_DMU_HP_PROCON_OTP0_S15ROM_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S16ROM */
#define IFX_DMU_HP_PROCON_OTP0_S16ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S16ROM */
#define IFX_DMU_HP_PROCON_OTP0_S16ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S16ROM */
#define IFX_DMU_HP_PROCON_OTP0_S16ROM_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S17ROM */
#define IFX_DMU_HP_PROCON_OTP0_S17ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S17ROM */
#define IFX_DMU_HP_PROCON_OTP0_S17ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S17ROM */
#define IFX_DMU_HP_PROCON_OTP0_S17ROM_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S18ROM */
#define IFX_DMU_HP_PROCON_OTP0_S18ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S18ROM */
#define IFX_DMU_HP_PROCON_OTP0_S18ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S18ROM */
#define IFX_DMU_HP_PROCON_OTP0_S18ROM_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S19ROM */
#define IFX_DMU_HP_PROCON_OTP0_S19ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S19ROM */
#define IFX_DMU_HP_PROCON_OTP0_S19ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S19ROM */
#define IFX_DMU_HP_PROCON_OTP0_S19ROM_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S20ROM */
#define IFX_DMU_HP_PROCON_OTP0_S20ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S20ROM */
#define IFX_DMU_HP_PROCON_OTP0_S20ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S20ROM */
#define IFX_DMU_HP_PROCON_OTP0_S20ROM_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S21ROM */
#define IFX_DMU_HP_PROCON_OTP0_S21ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S21ROM */
#define IFX_DMU_HP_PROCON_OTP0_S21ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S21ROM */
#define IFX_DMU_HP_PROCON_OTP0_S21ROM_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S22ROM */
#define IFX_DMU_HP_PROCON_OTP0_S22ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S22ROM */
#define IFX_DMU_HP_PROCON_OTP0_S22ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S22ROM */
#define IFX_DMU_HP_PROCON_OTP0_S22ROM_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S23ROM */
#define IFX_DMU_HP_PROCON_OTP0_S23ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S23ROM */
#define IFX_DMU_HP_PROCON_OTP0_S23ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S23ROM */
#define IFX_DMU_HP_PROCON_OTP0_S23ROM_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S24ROM */
#define IFX_DMU_HP_PROCON_OTP0_S24ROM_LEN (1u)

