Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S80ROM */
#define IFX_DMU_HP_PROCON_OTP2_S80ROM_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S81ROM */
#define IFX_DMU_HP_PROCON_OTP2_S81ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S81ROM */
#define IFX_DMU_HP_PROCON_OTP2_S81ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S81ROM */
#define IFX_DMU_HP_PROCON_OTP2_S81ROM_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S82ROM */
#define IFX_DMU_HP_PROCON_OTP2_S82ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S82ROM */
#define IFX_DMU_HP_PROCON_OTP2_S82ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S82ROM */
#define IFX_DMU_HP_PROCON_OTP2_S82ROM_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S83ROM */
#define IFX_DMU_HP_PROCON_OTP2_S83ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S83ROM */
#define IFX_DMU_HP_PROCON_OTP2_S83ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S83ROM */
#define IFX_DMU_HP_PROCON_OTP2_S83ROM_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S84ROM */
#define IFX_DMU_HP_PROCON_OTP2_S84ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S84ROM */
#define IFX_DMU_HP_PROCON_OTP2_S84ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S84ROM */
#define IFX_DMU_HP_PROCON_OTP2_S84ROM_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S85ROM */
#define IFX_DMU_HP_PROCON_OTP2_S85ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S85ROM */
#define IFX_DMU_HP_PROCON_OTP2_S85ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S85ROM */
#define IFX_DMU_HP_PROCON_OTP2_S85ROM_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S86ROM */
#define IFX_DMU_HP_PROCON_OTP2_S86ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S86ROM */
#define IFX_DMU_HP_PROCON_OTP2_S86ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S86ROM */
#define IFX_DMU_HP_PROCON_OTP2_S86ROM_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S87ROM */
#define IFX_DMU_HP_PROCON_OTP2_S87ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S87ROM */
#define IFX_DMU_HP_PROCON_OTP2_S87ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S87ROM */
#define IFX_DMU_HP_PROCON_OTP2_S87ROM_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S88ROM */
#define IFX_DMU_HP_PROCON_OTP2_S88ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S88ROM */
#define IFX_DMU_HP_PROCON_OTP2_S88ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S88ROM */
#define IFX_DMU_HP_PROCON_OTP2_S88ROM_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S89ROM */
#define IFX_DMU_HP_PROCON_OTP2_S89ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S89ROM */
#define IFX_DMU_HP_PROCON_OTP2_S89ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S89ROM */
#define IFX_DMU_HP_PROCON_OTP2_S89ROM_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S90ROM */
#define IFX_DMU_HP_PROCON_OTP2_S90ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S90ROM */
#define IFX_DMU_HP_PROCON_OTP2_S90ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S90ROM */
#define IFX_DMU_HP_PROCON_OTP2_S90ROM_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S91ROM */
#define IFX_DMU_HP_PROCON_OTP2_S91ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S91ROM */
#define IFX_DMU_HP_PROCON_OTP2_S91ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S91ROM */
#define IFX_DMU_HP_PROCON_OTP2_S91ROM_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S92ROM */
#define IFX_DMU_HP_PROCON_OTP2_S92ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S92ROM */
#define IFX_DMU_HP_PROCON_OTP2_S92ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S92ROM */
#define IFX_DMU_HP_PROCON_OTP2_S92ROM_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S93ROM */
#define IFX_DMU_HP_PROCON_OTP2_S93ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S93ROM */
#define IFX_DMU_HP_PROCON_OTP2_S93ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S93ROM */
#define IFX_DMU_HP_PROCON_OTP2_S93ROM_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S94ROM */
#define IFX_DMU_HP_PROCON_OTP2_S94ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S94ROM */
#define IFX_DMU_HP_PROCON_OTP2_S94ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S94ROM */
#define IFX_DMU_HP_PROCON_OTP2_S94ROM_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S95ROM */
#define IFX_DMU_HP_PROCON_OTP2_S95ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S95ROM */
#define IFX_DMU_HP_PROCON_OTP2_S95ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S95ROM */
#define IFX_DMU_HP_PROCON_OTP2_S95ROM_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S96ROM */
#define IFX_DMU_HP_PROCON_OTP3_S96ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S96ROM */
#define IFX_DMU_HP_PROCON_OTP3_S96ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S96ROM */
#define IFX_DMU_HP_PROCON_OTP3_S96ROM_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S97ROM */
#define IFX_DMU_HP_PROCON_OTP3_S97ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S97ROM */
#define IFX_DMU_HP_PROCON_OTP3_S97ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S97ROM */
#define IFX_DMU_HP_PROCON_OTP3_S97ROM_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S98ROM */
#define IFX_DMU_HP_PROCON_OTP3_S98ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S98ROM */
#define IFX_DMU_HP_PROCON_OTP3_S98ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S98ROM */
#define IFX_DMU_HP_PROCON_OTP3_S98ROM_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S99ROM */
#define IFX_DMU_HP_PROCON_OTP3_S99ROM_LEN (1u)

