Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S131WOP */
#define IFX_DMU_HP_PROCON_WOP4_S131WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S131WOP */
#define IFX_DMU_HP_PROCON_WOP4_S131WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S131WOP */
#define IFX_DMU_HP_PROCON_WOP4_S131WOP_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S132WOP */
#define IFX_DMU_HP_PROCON_WOP4_S132WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S132WOP */
#define IFX_DMU_HP_PROCON_WOP4_S132WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S132WOP */
#define IFX_DMU_HP_PROCON_WOP4_S132WOP_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S133WOP */
#define IFX_DMU_HP_PROCON_WOP4_S133WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S133WOP */
#define IFX_DMU_HP_PROCON_WOP4_S133WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S133WOP */
#define IFX_DMU_HP_PROCON_WOP4_S133WOP_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S134WOP */
#define IFX_DMU_HP_PROCON_WOP4_S134WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S134WOP */
#define IFX_DMU_HP_PROCON_WOP4_S134WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S134WOP */
#define IFX_DMU_HP_PROCON_WOP4_S134WOP_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S135WOP */
#define IFX_DMU_HP_PROCON_WOP4_S135WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S135WOP */
#define IFX_DMU_HP_PROCON_WOP4_S135WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S135WOP */
#define IFX_DMU_HP_PROCON_WOP4_S135WOP_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S136WOP */
#define IFX_DMU_HP_PROCON_WOP4_S136WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S136WOP */
#define IFX_DMU_HP_PROCON_WOP4_S136WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S136WOP */
#define IFX_DMU_HP_PROCON_WOP4_S136WOP_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S137WOP */
#define IFX_DMU_HP_PROCON_WOP4_S137WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S137WOP */
#define IFX_DMU_HP_PROCON_WOP4_S137WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S137WOP */
#define IFX_DMU_HP_PROCON_WOP4_S137WOP_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S138WOP */
#define IFX_DMU_HP_PROCON_WOP4_S138WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S138WOP */
#define IFX_DMU_HP_PROCON_WOP4_S138WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S138WOP */
#define IFX_DMU_HP_PROCON_WOP4_S138WOP_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S139WOP */
#define IFX_DMU_HP_PROCON_WOP4_S139WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S139WOP */
#define IFX_DMU_HP_PROCON_WOP4_S139WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S139WOP */
#define IFX_DMU_HP_PROCON_WOP4_S139WOP_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S140WOP */
#define IFX_DMU_HP_PROCON_WOP4_S140WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S140WOP */
#define IFX_DMU_HP_PROCON_WOP4_S140WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S140WOP */
#define IFX_DMU_HP_PROCON_WOP4_S140WOP_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S141WOP */
#define IFX_DMU_HP_PROCON_WOP4_S141WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S141WOP */
#define IFX_DMU_HP_PROCON_WOP4_S141WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S141WOP */
#define IFX_DMU_HP_PROCON_WOP4_S141WOP_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S142WOP */
#define IFX_DMU_HP_PROCON_WOP4_S142WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S142WOP */
#define IFX_DMU_HP_PROCON_WOP4_S142WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S142WOP */
#define IFX_DMU_HP_PROCON_WOP4_S142WOP_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S143WOP */
#define IFX_DMU_HP_PROCON_WOP4_S143WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S143WOP */
#define IFX_DMU_HP_PROCON_WOP4_S143WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S143WOP */
#define IFX_DMU_HP_PROCON_WOP4_S143WOP_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S144WOP */
#define IFX_DMU_HP_PROCON_WOP4_S144WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S144WOP */
#define IFX_DMU_HP_PROCON_WOP4_S144WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S144WOP */
#define IFX_DMU_HP_PROCON_WOP4_S144WOP_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S145WOP */
#define IFX_DMU_HP_PROCON_WOP4_S145WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S145WOP */
#define IFX_DMU_HP_PROCON_WOP4_S145WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S145WOP */
#define IFX_DMU_HP_PROCON_WOP4_S145WOP_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S146WOP */
#define IFX_DMU_HP_PROCON_WOP4_S146WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S146WOP */
#define IFX_DMU_HP_PROCON_WOP4_S146WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S146WOP */
#define IFX_DMU_HP_PROCON_WOP4_S146WOP_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S147WOP */
#define IFX_DMU_HP_PROCON_WOP4_S147WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S147WOP */
#define IFX_DMU_HP_PROCON_WOP4_S147WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S147WOP */
#define IFX_DMU_HP_PROCON_WOP4_S147WOP_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S148WOP */
#define IFX_DMU_HP_PROCON_WOP4_S148WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S148WOP */
#define IFX_DMU_HP_PROCON_WOP4_S148WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S148WOP */
#define IFX_DMU_HP_PROCON_WOP4_S148WOP_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S149WOP */
#define IFX_DMU_HP_PROCON_WOP4_S149WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S149WOP */
#define IFX_DMU_HP_PROCON_WOP4_S149WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S149WOP */
#define IFX_DMU_HP_PROCON_WOP4_S149WOP_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S150WOP */
#define IFX_DMU_HP_PROCON_WOP4_S150WOP_LEN (1u)

