Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM14ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM14ROM_OFF (14u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM15ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM15ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM15ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM15ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM15ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM15ROM_OFF (15u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM16ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM16ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM16ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM16ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM16ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM16ROM_OFF (16u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM17ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM17ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM17ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM17ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM17ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM17ROM_OFF (17u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM18ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM18ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM18ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM18ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM18ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM18ROM_OFF (18u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM19ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM19ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM19ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM19ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM19ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM19ROM_OFF (19u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM20ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM20ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM20ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM20ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM20ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM20ROM_OFF (20u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM21ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM21ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM21ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM21ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM21ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM21ROM_OFF (21u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM22ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM22ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM22ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM22ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM22ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM22ROM_OFF (22u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM23ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM23ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM23ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM23ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM23ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM23ROM_OFF (23u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM24ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM24ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM24ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM24ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM24ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM24ROM_OFF (24u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM25ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM25ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM25ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM25ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM25ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM25ROM_OFF (25u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM26ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM26ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM26ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM26ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM26ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM26ROM_OFF (26u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM27ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM27ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM27ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM27ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM27ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM27ROM_OFF (27u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM28ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM28ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM28ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM28ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM28ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM28ROM_OFF (28u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM29ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM29ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM29ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM29ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM29ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM29ROM_OFF (29u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM30ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM30ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM30ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM30ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM30ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM30ROM_OFF (30u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM31ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM31ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM31ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM31ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM31ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM31ROM_OFF (31u)

